const mainQuestionsDB = [
  //https://hsc.gov.ua/wp-content/uploads/2025/11/POLOTNO-NAKAZ_04_09_2025%20(1).pdf
  //https://hsc.gov.ua/wp-content/uploads/2025/11/Numer_-vidpovidej-do-nakazu.pdf
  {
    id: 1,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Трамвайна колія – елемент дороги, призначений для руху рейкових транспортних засобів, який обмежується по ширині:",
    options: [
      "Спеціально виділеним вимощенням трамвайної лінії.",
      "Дорожньою розміткою.",
      "Відповіді, зазначені в пунктах 1 та 2."
    ],
    correctAnswer: 2,
    image: "image/p1.png"
  },

  {
    id: 2,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Елемент дороги, призначений для руху рейкових транспортних засобів, який обмежується по ширині спеціально виділеним вимощенням трамвайної лінії або дорожньою розміткою це:",
    options: [
      "Трамвайна колія",
      "Удосконалене покриття",
      "Смуга руху"
    ],
    correctAnswer: 0
  },
  {
    id: 3,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "По якому з наведених елементів дороги дозволено рух нерейкових транспортних засобів?",
    options: [
      "По тротуару.",
      "По трамвайній колії.",
      "По проїзній частині.",
      "Відповіді 2 та 3."
    ],
    correctAnswer: 3
  },
  {
    id: 4,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи належить до проїзної частини велосипедна смуга?",
    options: [
      "Так, належить.",
      "Нi, не належить."
    ],
    correctAnswer: 0
  },
  {
    id: 5,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Для руху яких транспортних засобів призначена проїзна частина?",
    options: [
      "Нерейкових транспортних засобів.",
      "Рейкових транспортних засобів",
      "Нерейкових та рейкових транспортних засобів."
    ],
    correctAnswer: 0
  },
  {
    id: 6,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Що означає вимога дати дорогу?",
    options: [
      "Вимога до учасника дорожнього руху не продовжувати або не відновлювати рух, якщо це може примусити інших учасників дорожнього руху, які мають перевагу, змінити напрямок руху або швидкість",
      "Вимога до учасника дорожнього руху не здійснювати будь-яких маневрів (за винятком вимоги звільнити займану смугу руху), якщо це може примусити інших учасників дорожнього руху, які мають перевагу, змінити напрямок руху або швидкість.",
      " Відповідь 1 і 2"
    ],
    correctAnswer: 2
  },
   {
    id: 7,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Поздовжня смуга на проїзній частині завширшки щонайменше 2,75 м, що позначена або не позначена дорожньою розміткою і призначена для руху нерейкових транспортних засобів це:",
    options: [
      "Розділювальна смуга.",
      "Смуга руху.",
      "Трамвайна колія"
    ],
    
    correctAnswer: 1,
    image: "image/p7.png"
  },
  {
    id: 8,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Які із наведених категорій осіб, належать до визначення «учасник дорожнього руху»?",
    options: [
      "Регулювальник, пішоходи, водії, пасажири, велосипедисти, а також особи, які рухаються в кріслі колісному",
      "Регулювальник, пішоходи, водії, пасажири, велосипедисти, а також особи, які рухаються в кріслі колісному",
      "Пішоходи, водії, пасажири, погоничі тварин, велосипедисти та регулювальник.",
      
    ],
    correctAnswer: 1
  },
  {
    id: 9,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Яка із наведених категорій осіб бере участь у дорожньому русі поза транспортними засобами та не виконує на дорозі будь-яку роботу:",
    options: [
      "Пішохід.",
      "Пасажир.",
      "Регулювальник.",
    ],
    correctAnswer: 0
  },
  {
    id: 10,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Особа, яка користується транспортним засобом і перебуває в ньому, але не причетна до керування ним, це:",
    options: [
      "Пасажир.",
      "Пішохід.",
      "Особа, яка рухається в кріслі колісному.",
    ],
    correctAnswer: 0
  },
  {
    id: 11,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " Колона пішоходів це:",
    options: [
      "Організована група людей, які рухаються по тротуару в одному напрямку.",
      "Організована група людей, які рухаються узбіччям в одному напрямку.",
      "Організована група людей, які рухаються по проїзній частині в одному напрямку.",
    ],
    correctAnswer: 2
  },
  
  {
    id: 12,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Регульованим пішохідним переходом вважається:",
    options: [
      "Пішохідний перехід, рух по якому регулюється світлофором чи регулювальником.",
      "Пішохідний перехід, рух по якому регулюється дорожніми знаками або дорожньою розміткою.",
    ],
    correctAnswer: 0
  },
  {
    id: 13,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Пішохідний перехід, на якому немає регулювальника, відсутні світлофори або вимкнені чи працюють у режимі миготіння жовтого сигналу вважається:",
    options: [
      "Регульованим",
      "Нерегульованим.",
    ],
    correctAnswer: 1
  },
  {
    id: 14,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Доріжка з покриттям, призначена для руху пішоходів, виконана в межах дороги чи поза нею і позначена наведеним дорожнім знаком це:",
    options: [
      " Пішохідна доріжка",
      "Велосипедна доріжка.",
      "Пішохідна смуга",
    ],
    correctAnswer: 0,
    image: "image/p14.png"
  },
  {
    id: 15,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи призначена пішохідна доріжка для руху велосипедистів?",
    options: [
      "Так, призначена.",
      "Ні, не призначена.",
    ],
    correctAnswer: 1
  },
  {
    id: 16,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " Чи призначена пішохідна доріжка для руху осіб, які рухаються вкріслах колісних без двигуна?",
    options: [
      "Так, призначена.",
      "Ні, не призначена.",
    ],
    correctAnswer: 0
  },
  {
    id: 17,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи призначена пішохідна доріжка для руху осіб, які ведуть мопед?",
    options: [
      "Так, призначена.",
      "Ні, не призначена.",
    ],
    correctAnswer: 0
  },
  {
    id: 18,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "На якому з наведених малюнків зображено перехрестя:",
    options: [
      "На першому.",
      "На другому.",
    ],
    correctAnswer: 1,
    image: "image/p18.png"
  },
  {
    id: 19,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "На якому малюнку зображено в’їзд на прилеглу територію:",
    options: [
      "На першому.",
      "На другому.",
    ],
    correctAnswer: 1,
    image: "image/p19.png"
  },
  {
    id: 20,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи може автомагістраль перетинати на одному рівні інші дороги, залізничні і трамвайні колії, пішохідні та велосипедні доріжки, шляхи проходу тварин?",
    options: [
      "Так, може.",
      "Ні, не може.",
    ],
    correctAnswer: 1
  },
  {
    id: 21,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи вважається перехрестям місце прилягання до дороги виїзду з прилеглої території (дворів)?",
    options: [
      "Так, вважається.",
      "Ні, невважається.",
    ],
    correctAnswer: 1
  },
  {
    id: 22,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Показаний на малюнку поворот дороги відповідає терміну:",
    options: [
      " «Обмежена оглядовість дороги».",
      "«Недостатня видимість дороги».",
    ],
    correctAnswer: 0,
    image: "image/p22.png"
  },
  {
    id: 23,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Як називається даний маневр?",
    options: [
      "Обгін",
      "Об'їзд.",
      "Випередженя.",
    ],
    correctAnswer: 2,
    image: "image/p23.png"
  },
  {
    id: 24,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Автомобільна дорога призначена для руху:",
    options: [
      "Транспортних засобів",
      "Пішоходів і тварин.",
      "Транспортних засобів і пішоходів.",
      "Варіант 1 та 2.",
    ],
    correctAnswer: 2
  },
  {
    id: 25,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "достатньою видимістю вважається:",
    options: [
      "Обмежена оглядовість менше 300 м.",
      "Видимість дороги в напрямку руху менше 300 метрів, обмежена поворотом дороги",
      "Видимість дороги в напрямку руху менше 300 м у сутінках, в умовах туману, дощу, снігопаду тощо",
      "Небезпечний поворот, небезпечний підйом, небезпечний спуск.",
    ],
    correctAnswer: 2,
    image: "image/p25.png"
  },
  {
    id: 26,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Доріжка з покриттям поза межами проїзної частини вулиці та/або дороги, розташована окремо чи суміжно з тротуаром або пішохідною доріжкою, що призначена для руху на велосипедах, і позначена дорожнім знаком та горизонтальною розміткою, як показано на малюнку, це:",
    options: [
      "Велосипедна доріжка.",
      "Велосипедна смуга.",
      "Велосипедний переїзд.",
    ],
    correctAnswer: 0,
    image: "image/p26.png"
  },
  {
    id: 27,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Як називається доріжка зображена на наведеному малюнку?",
    options: [
      "Велосипедна доріжка.",
      "Велосипедна смуга.",
      "Велосипедний переїзд.",
    ],
    correctAnswer: 0,
    image: "image/p27.png"
  },
  {
    id: 28,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Доріжка з покриттям поза межами проїзної частини вулиці та/або дороги, розташована окремо чи суміжно з тротуаром або пішохідною доріжкою, і позначена дорожнім знаком та горизонтальною розміткою, як показано на малюку, призначена для руху:",
    options: [
      "Пішоходів.",
      "На велосипедах.",
      "Відповідь 1 та 2.",
    ],
    correctAnswer: 1,
    image: "image/p28.png"
  },
  {
    id: 29,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " Смуга, призначена для руху на велосипедах у межах проїзної частини вулиці та/або дороги, яка позначена дорожнім знаком 5.88 та відповідною горизонтальною дорожньою розміткою це:",
    options: [
      "Велосипедна доріжка.",
      "Велосипедна смуга.",
      "Велосипедний переїзд.",
    ],
    correctAnswer: 1,
    image: "image/p29.png"
  },
  {
    id: 30,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " Велосипедною доріжкою дозволяється рух:",
    options: [
      "Особам, які рухаються із швидкістю пішохода в кріслах колісних",
      "Особам, які везуть візок, якщо немає тротуару або пішохідної доріжки.",
      "Велосипедистам.",
      "Пішоходам.",
      "Усім переліченим учасникам дорожнього руху.",
    ],
    correctAnswer: 4
  },
  {
    id: 31,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Що з переліченого нижче відповідає терміну «небезпека для руху»?",
    options: [
      "Зміна дорожньої обстановки (у тому числі поява рухомого об’єкта, який наближається до смуги руху транспортного засобу чи перетинає її), яка загрожує безпеці дорожнього руху і змушує водія негайно зменшити швидкість або зупинитися.",
      "Зміна технічного стану транспортного засобу, яка загрожує безпеці дорожнього руху і змушує водія негайно зменшити швидкість або зупинитися.",
      "Відповіді 1 та 2.",
    ],
    correctAnswer: 2
  },
  {
    id: 32,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Елемент дороги, призначений для руху пішоходів, який прилягає до проїзної частини або відокремлений від неї газоном це:",
    options: [
      "Тротуар.",
      "Узбіччя",
      "Розділювальна смуга.",
    ],
    correctAnswer: 0
  },
  {
    id: 33,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи є тротуар елементом автомобільної дороги?",
    options: [
      "Так",
      "Ні",
    ],
    correctAnswer: 0
  },
  {
    id: 34,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи вважається тротуар елементом проїзної частини?",
    options: [
      "Так, вважається.",
      "Ні, невважається.",
    ],
    correctAnswer: 1
  },
  {
    id: 35,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи дозволено велосипедистам рухатись по тротуару?",
    options: [
      "Дозволено.",
      "Заборонено.",
      "Заборонено, крім дітей до 7 років на дитячих велосипедах під наглядом дорослих.",
    ],
    correctAnswer: 2
  },
  {
    id: 36,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Що з переліченого нижче відповідає терміну «видимість у напрямку руху»?",
    options: [
      "Мінімальна відстань, на якій з місця водія можна побачити «стоп-лінію».",
      "Максимальна відстань вправо від напрямку руху, на якій можна розпізнати транспортні засоби, що наближаються до перехрестя по головній дорозі.",
      "Максимальна відстань, на якій з місця водія можна чітко розпізнати межі елементів дороги та розміщення учасників руху, що дає змогу водієві орієнтуватися під час керування транспортним засобом.",
    ],
    correctAnswer: 2
  },
  {
    id: 37,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "На якому з наведених малюнків зображена автомобільна дорога?",
    options: [
      "На малюнку 1.",
      "На малюнку 2.",
      "На обох малюнках.",
    ],
    correctAnswer: 2,
    image: "image/p37.png"
  },
  {
    id: 38,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Для руху яких транспортних засобів призначена проїзна частина?",
    options: [
      "Рейкових транспортних засобів",
      "Нерейкових транспортних засобів.",
      "Відповіді 1 і 2.",
    ],
    correctAnswer: 1
  },
  {
    id: 39,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи може дорога мати декілька проїзних частин?",
    options: [
      "Так, може.",
      "Ні, не може",
    ],
    correctAnswer: 0
  },
  {
    id: 40,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи вважається довільно накатана колія автомобільною дорогою?",
    options: [
      "Так, вважається.",
      "Ні, не вважається",
    ],
    correctAnswer: 1
  },
  {
    id: 41,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Обмежена оглядовість – це:",
    options: [
      "Видимість дороги в напрямку руху менше 300 м в умовах недостатньої видимості, яка обмежена геометричними параметрами дороги.",
      " Видимість дороги в напрямку руху, яка обмежена геометричними параметрами дороги, придорожніми інженерними спорудами, насадженнями та іншими об’єктами, а також транспортними засобами",
      "Оглядовість дороги, обмежена умовами туману, дощу, снігопаду тощо.",
    ],
    correctAnswer: 1
  },
  {
    id: 42,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Що означає термін «перевага»?",
    options: [
      "Право на першочерговий рух стосовно інших учасників дорожнього руху",
      "Вимога, що означає не відновлювати або не продовжувати рух або не здійснювати будь-яких маневрів, якщо це може змусити іншого учасника дорожнього руху змінити напрямок або швидкість руху.",
      "Положення транспортного засобу на проїжджій частині дороги, призначеної для руху в даному напрямку, що не дає можливості руху навіть двоколісних транспортних засобів відповідно правіше (лівіше) в попутному напрямку.",
    ],
    correctAnswer: 0
  },
  {
    id: 43,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Рейковим транспортом вважається:",
    options: [
      "Трамвай або транспортний засіб, що рухається трамвайною колією",
      "Платформа зі спеціальним обладнанням, що рухається по залізничній колії",
      "Трамвай і платформа зі спеціальним обладнанням, що рухаються трамвайними коліями.",
    ],
    correctAnswer: 2
  },
{
    id: 44,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Дозволеною максимальною масою вважається:",
    options: [
      "Маса спорядженого транспортного засобу з вантажем, водієм і пасажирами, що встановлена технічною характеристикою транспортного засобу як максимально допустима",
      "Вага транспортного засобу з вантажем, водієм і пасажирами, встановлена технічною характеристикою на даний транспортний засіб підприємствомвиробником, яка не повинна перевищувати 3500 кг",
    ],
    correctAnswer: 0
  },
  {
    id: 45,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " В якому з перелічених випадків водій здійснив вимушену зупинку?",
    options: [
      "Зупинився на узбіччі через прокол колеса.",
      "Зупинився на смузі руху через засліплення фарами зустрічного автомобіля.",
      "Зупинився, щоб надати допомогу пасажиру.",
      "Відповіді 1, 2, 3.",
    ],
    correctAnswer: 3
  },
  {
    id: 46,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "До маршрутних транспортних засобів (транспортних засобів загального користування) належать:",
    options: [
      "Трамваї, тролейбуси, автобуси, таксі.",
      " Транспортні засоби з кількістю місць для сидіння не менш ніж сімнадцять з місцем водія включно, що рухаються за встановленими маршрутами та мають визначені місця на дорозі для посадки (висадки) пасажирів",
      "Автобуси, мікроавтобуси, тролейбуси, трамваї і таксі, що рухаються за встановленими маршрутами та мають визначені місця на дорозі для посадки (висадки) пасажирів.",
    ],
    correctAnswer: 2
  },
  {
    id: 47,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Оглядовістю вважається:",
    options: [
      "Об’єктивна можливістьбачити дорожню обстановку з місця водія",
      "Видимість дороги в напрямку руху, яка обмежена геометричними параметрами дороги",
      "Максимальна відстань, на якій з місця водія можна чітко розпізнати межіелементів дороги та розміщення учасників руху.",
    ],
    correctAnswer: 0
  },
  {
    id: 48,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Обмежена оглядовість – це видимість дороги в напрямку руху, яка обмежена:",
    options: [
      "Геометричними параметрами дороги.",
      "Придорожніми інженерними спорудами, насадженнями та іншими об’єктами, а також транспортними засобами.",
      "Погоднимиявищами, такими як дощ, снігопад, туман і тощо",
      "Відповіді 1, 2.",
    ],
    correctAnswer: 3
  },
  {
    id: 49,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "З якого боку дозволено виконати випередження на проїзній частині?",
    options: [
      "Тільки з лівого боку",
      "Тільки з правого боку",
      "З будь-якого боку по суміжній смузі з дотриманням безпечного інтервалу.",
    ],
    correctAnswer: 2
  },
  {
    id: 50,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Що з переліченого є прилеглою територією?",
    options: [
      " Місце перехрещення, прилягання або розгалуження доріг на одному рівні.",
      "Територія, що прилягає до краю проїзної частини та не призначена для наскрізного проїзду, а лише для в’їзду до дворів, на стоянки, автозаправні станції, будівельні майданчики тощо або виїзду з них.",
      "Місце для в’їзду до дворів, на стоянки, автозаправні станції, будівельні майданчики тощо або виїзду з них. ",
      "Відповідь 1 та 3.",
    ],
    correctAnswer: 1
  },
  {
    id: 51,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Розділювальна смуга призначена:",
    options: [
      "Для зупинки та стоянки транспортних засобів.",
      "Для руху велосипедистів за умови відсутності велосипедної доріжки",
      "Для розділення суміжних проїзних частин та руху пішоходів за наявності на ній тротуару.",
    ],
    correctAnswer: 2,
    image: "image/p51.png"
  },
  {
    id: 52,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Який елемент автомобільної дороги зображено на наведеному малюнку?",
    options: [
      "Розділювальна смуга.",
      "Тротуар.",
      "Узбіччя.",
      "Газон",
    ],
    correctAnswer: 0,
    image: "image/p52.png"
  },
  {
    id: 53,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи призначена розділювальна смуга для руху або стоянки транспортних засобів?",
    options: [
      "Так, призначена.",
      "Ні, не призначена",
    ],
    correctAnswer: 1,
    image: "image/p53.png"
  },
  {
    id: 54,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Засліплення це:",
    options: [
      " Фізіологічний стан водія внаслідок дії світла на його зір, коли водій об’єктивно не має можливості виявити перешкоди чи розпізнати межі елементів дороги на мінімальній відстані.",
      "Фізіологічний стан водія внаслідок дії світла на його зір, коли на деякий час видимість для водія стає поганою, але він має можливість виявити перешкоди чи розпізнати межі елементів дороги на мінімальній відстані.",
    ],
    correctAnswer: 0
  },
  {
    id: 55,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи зобов’язані водії бути особливо уважними до велосипедистів",
    options: [
      "Так, зобов’язані.",
      "Ні, не зобов’язані.",
    ],
    correctAnswer: 0,
    image: "image/p55.png"
  },
  {
    id: 56,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Особи, які ведуть мотоцикл прирівнюються до:",
    options: [
      "Водіїв",
      "Пішоходів.",
      "Велосипедистів",
    ],
    correctAnswer: 1,
    image: "image/p56.png"
  },
  {
    id: 57,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Особи, які ведуть мотоцикл прирівнюються до пішоходів?",
    options: [
      "Так",
      "Ні",
    ],
    correctAnswer: 0,
    image: "image/p57.png"
  },
  {
    id: 58,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи прирівнюються до пішоходів особи, які везуть дитячий візок?",
    options: [
      "Так, прирівнюються.",
      "Ні, не прирівнюються.",
    ],
    correctAnswer: 0,
    image: "image/p58.png"
  },
  {
    id: 59,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Особи, які рухаються у кріслах колісних, є учасниками дорожнього руху?",
    options: [
      "Так.",
      "Ні.",
    ],
    correctAnswer: 0,
    image: "image/p59.png"
  },
  {
    id: 60,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи відноситься штучна споруда (естакада, шляхопровід, міст тощо), яка призначена для руху транспортних засобів до елемента автомобільної дороги?",
    options: [
      "Так, відноситься.",
      "Ні, не відноситься.",
    ],
    correctAnswer: 0
  },
  {
    id: 61,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "нженерна споруда призначена для руху транспортних засобів та/або пішоходів, підняття однієї дороги над іншою у місці їх перетину та не має з’їздів на іншу дорогу це:",
    options: [
      "Естакада.",
      "Міст",
      "Шляхопровід",
    ],
    correctAnswer: 0
  },
  {
    id: 62,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Який транспортний засіб призначений для руху тільки в з’єднанні з іншим транспортним засобом?",
    options: [
      "Причіп",
      "Автопоїзд",
      "Рейковий транспортний засіб.",
    ],
    correctAnswer: 0
  },
  {
    id: 63,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи дозволено пішоходам рухатись узбіччям?",
    options: [
      "Дозволено, за відсутності тротуарів, пішохідних доріжок.",
      "Дозволено за будь-яких умов.",
      "Заборонено",
    ],
    correctAnswer: 0
  },
  {
    id: 64,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи призначено узбіччя для руху транспортних засобів?",
    options: [
      "Так, призначено",
      " Ні, не призначено, крім випадків, передбачених Правилами дорожнього руху.",
    ],
    correctAnswer: 1
  },
  {
    id: 65,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "У наведеному випадку суцільна лінія дорожньої розмітки вважається межею проїзної частини та узбіччя? ",
    options: [
      "Так",
      "Ні",
    ],
    correctAnswer: 0,
    image: "image/p65.png"
  },
  {
    id: 66,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " На наведеному малюнку зображено узбіччя?",
    options: [
      "Так",
      "Ні.",
    ],
    correctAnswer: 1,
    image: "image/p66.png"
  },
  {
    id: 67,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Технічний засіб регулювання дорожнього руху на наземних пішохідних переходах, конструктивно виділений над проїзною частиною дороги та призначений як захисний елемент для зупинки пішоходів під час переходу проїзної частини дороги це:",
    options: [
      "Острівець безпеки.",
      "Пішохідна доріжка",
      "Тротуар",
    ],
    correctAnswer: 0
  },
  {
    id: 68,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Чи призначений острівець безпеки для посадки (висадки) пасажирів маршрутних транспортних засобів?",
    options: [
      " Так, призначений.",
      " Ні,не призначений.",
    ],
    correctAnswer: 1
  },
  {
    id: 69,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Припинення руху транспортного засобу через його технічну несправність чи небезпеку, яка спричинена вантажем, який перевозиться, станом учасника дорожнього руху, появою перешкоди для руху відноситься до терміну:",
    options: [
      "Дорожньо-транспортна пригода",
      "Вимушена зупинка.",
      "Стоянка",
    ],
    correctAnswer: 1
  },
  {
    id: 70,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Перехрещення дороги із залізничними коліями на одному рівні вважається:",
    options: [
      "Регульованим перехрестям.",
      "Залізничним переїздом.",
      "Шляхопроводом.",
    ],
    correctAnswer: 1
  },
  {
    id: 71,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Частина території, зокрема, в населеному пункті, з усіма розташованими на ній спорудами та засобами організації дорожнього руху, призначена для руху транспортних засобів і пішоходів та обмежена по ширині зовнішнім краєм тротуарів чи краєм смуги відводу, вважається:",
    options: [
      "Автомагістраллю.",
      "Автомобільною дорогою, вулицею (дорогою).",
      "Проїзною частиною."
    ],
    correctAnswer: 1
  },
  {
    id: 72,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Пішохідний перехід призначений для руху:",
    options: [
      "Пішоходів через дорогу",
      "На велосипедах.",
      "Варіант 1 і 2.",
    ],
    correctAnswer: 0
  },
  {
    id: 73,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Зовнішні світлові прилади білого кольору, передбачені конструкцією транспортного засобу, установлені спереду транспортного засобу і призначені для покращення видимості транспортного засобу під час його руху у світлий час доби це:",
    options: [
      "Габаритні ліхтарі",
      "Денні ходові вогні.",
      "Ближнє світло фар",
    ],
    correctAnswer: 1
  },
  {
    id: 74,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " Яка із наведених категорій осіб не прирівнюється до пішоходів?",
    options: [
      "Особи, які рухаються в кріслах колісних без двигуна.",
      "Особи, які рухаються на велосипедах.",
      "Особи, які везуть візок.",
      "Відповіді 1 і 2.",
    ],
    correctAnswer: 1
  },
  {
    id: 75,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Яке із наведених визначень відповідає терміну колона транспортних засобів:",
    options: [
      "Організована група двох транспортних засобів, що разом рухаються в одному напрямку безпосередньо один за одним з постійно увімкненим ближнім світлом фар.",
      "Організована група з трьох і більше транспортних засобів, що разом рухаються в одному напрямку безпосередньо один за одним з постійно увімкненим ближнім світлом фар. ",
      "Організована група двох транспортних засобів, що разом рухаються в одному напрямку безпосередньо один за одним з постійно увімкненою аварійною сигналізацією.",
      "Організована група з трьох і більше транспортних засобів, що разом рухаються в одному напрямку безпосередньо один за одним з постійно увімкненою аварійною сигналізацією.",
    ],
    correctAnswer: 1
  },
  {
    id: 76,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "Якому терміну відповідає сукупність факторів, що характеризуються дорожніми умовами, наявністю перешкод на певній ділянці дороги, інтенсивністю і рівнем організації дорожнього руху (наявність та стан дорожньої розмітки, дорожніх знаків, дорожнього обладнання, світлофорів), які повинен ураховувати водій під час вибору швидкості, смуги руху та прийомів керування транспортним засобом?",
    options: [
      "Дорожні роботи",
      "Дорожні умови.",
      "Дорожня обстановка."
    ],
    correctAnswer: 2
  },
  {
    id: 77,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "До терміну «оглядовість» належить:",
    options: [
      "Об’єктивна можливість бачити дорожню обстановку з місця водія.",
      "Видимість дороги в напрямку руху.",
      "Об’єктивна можливість водія розпізнати межі елементів дороги та розміщення учасників дорожнього руху.",
    ],
    correctAnswer: 0
  },
  {
    id: 78,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: "До якого виду транспортних засобів відносяться трактори, самохідні шасі, дорожньо-будівельні, меліоративні машини та інші механізми?",
    options: [
      "Легкових автомобілів",
      "Вантажних автомобілів.",
      "Сільськогосподарської техніки.",
      " Відповідь 2 і 3.",
    ],
    correctAnswer: 2
  },
  {
    id: 79,
    category: "ЗАГАЛЬНІ ПОЛОЖЕННЯ",
    question: " Безпечною швидкістю руху вважається:",
    options: [
      "Мінімально допустима швидкість руху, за якою водій контролює дорожню обстановку та пам’ятає про небезпеку на дорозі.",
      "Швидкість, за якої водій має змогу безпечно керувати транспортним засобом та контролювати його рух у конкретних дорожніх умовах.",
    ],
    correctAnswer: 1
  },
  {
    id: 80,
    category: "ОБОВ'ЯЗКИ І ПРАВА ВОДІЇВ МЕХАНІЧНИХ ТРАНСПОРТНИХ ЗАСОБІВ",
    question: "У разі, якщо неможливо вжити заходи для надання домедичної допомоги потерпілому та викликати бригаду екстреної (швидкої) медичної допомоги, а також якщо з місця ДТП немає можливості відправити потерпілого до лікувального закладу за допомогою інших осіб, водій зобов'язаний:",
    options: [
      "Не залишати місце дорожньо-транспортної пригоди і чекати будь-який транспортний засіб, що рухається в попутному напрямку, для доставки потерпілого.",
      "Відвезти потерпілого в найближчий лікувальний заклад своїм транспортним засобом, попередньо зафіксувавши розташування слідів пригоди, в лікувальному закладі повідомити своє прізвище та номерний знак транспортного засобу (з пред'явленням посвідчення водія або іншого документа, що посвідчує особу, реєстраційного документа на транспортний засіб) і повернутися на місце події.",
    ],
    correctAnswer: 1
  },
  

];